; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v12 ?v2)
             (pred_1 ?v9 ?v8)
             (pred_10 ?v12 ?v8)
             (pred_7 ?v4 ?v12 )
	     (pred_4 ?v12)
             (pred_12 ?v7)
             (pred_8 ?v9)
             (pred_9 ?v8)
             (pred_11 ?v12)
             (pred_6 ?v9)
             (pred_5 ?v12)
             (pred_2 ))



(:action op_2
:parameters (?v6 ?v10 ?v3 ?v1)
:precondition (and (pred_12 ?v6) (pred_12 ?v10) (pred_8 ?v3) (pred_9 ?v1)
          (pred_3 ?v6 ?v10) (pred_1 ?v3 ?v1)
                   (pred_10 ?v10 ?v1) (pred_4 ?v6) 
                   (pred_11 ?v10) (pred_6 ?v3))
:effect (and  (pred_5 ?v10) (not (pred_11 ?v10))))


(:action op_5
:parameters (?v6 ?v11)
:precondition (and (pred_12 ?v6) (pred_12 ?v11)
               (pred_4 ?v6) (pred_3 ?v6 ?v11) (pred_5 ?v11))
:effect (and (pred_4 ?v11) (not (pred_4 ?v6))))

(:action op_3
:parameters (?v6 ?v3)
:precondition (and (pred_12 ?v6) (pred_8 ?v3) 
                  (pred_4 ?v6) (pred_7 ?v3 ?v6) (pred_2 ))
:effect (and (pred_6 ?v3)
   (not (pred_7 ?v3 ?v6)) (not (pred_2 ))))


(:action op_1
:parameters (?v6 ?v13 ?v5)
:precondition (and (pred_12 ?v6) (pred_8 ?v13) (pred_8 ?v5)
                  (pred_4 ?v6) (pred_6 ?v5) (pred_7 ?v13 ?v6))
:effect (and (pred_6 ?v13) (pred_7 ?v5 ?v6)
        (not (pred_6 ?v5)) (not (pred_7 ?v13 ?v6))))

(:action op_4
:parameters (?v6 ?v3)
:precondition (and (pred_12 ?v6) (pred_8 ?v3) 
                  (pred_4 ?v6) (pred_6 ?v3))
:effect (and (pred_2 ) (pred_7 ?v3 ?v6) (not (pred_6 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_07 obj_05 obj_30 obj_06 obj_23 obj_32 obj_11 obj_09 obj_12 obj_19 obj_25 obj_13 obj_01 obj_03 obj_29 obj_20 obj_22 obj_21 obj_31 obj_15 obj_27 obj_04 obj_02 obj_26 obj_17
    obj_08 obj_14 obj_24
    obj_16 obj_10 obj_28 obj_18
    )

    (:init
       (pred_2)

       (pred_12 obj_07)
       (pred_12 obj_05)
       (pred_12 obj_30)
       (pred_12 obj_06)
       (pred_12 obj_23)
       (pred_12 obj_32)
       (pred_12 obj_11)
       (pred_12 obj_09)
       (pred_12 obj_12)
       (pred_12 obj_19)
       (pred_12 obj_25)
       (pred_12 obj_13)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_29)
       (pred_12 obj_20)
       (pred_12 obj_22)
       (pred_12 obj_21)
       (pred_12 obj_31)
       (pred_12 obj_15)
       (pred_12 obj_27)
       (pred_12 obj_04)
       (pred_12 obj_02)
       (pred_12 obj_26)
       (pred_12 obj_17)
       (pred_9 obj_08)
       (pred_9 obj_14)
       (pred_9 obj_24)
       (pred_8 obj_16)
       (pred_8 obj_10)
       (pred_8 obj_28)
       (pred_8 obj_18)

       (pred_3 obj_07 obj_32)
       (pred_3 obj_07 obj_05)
       (pred_3 obj_05 obj_11)
       (pred_3 obj_05 obj_30)
       (pred_3 obj_05 obj_07)
       (pred_3 obj_30 obj_09)
       (pred_3 obj_30 obj_06)
       (pred_3 obj_30 obj_05)
       (pred_3 obj_06 obj_12)
       (pred_3 obj_06 obj_23)
       (pred_3 obj_06 obj_30)
       (pred_3 obj_23 obj_19)
       (pred_3 obj_23 obj_06)
       (pred_3 obj_32 obj_25)
       (pred_3 obj_32 obj_11)
       (pred_3 obj_32 obj_07)
       (pred_3 obj_11 obj_13)
       (pred_3 obj_11 obj_09)
       (pred_3 obj_11 obj_05)
       (pred_3 obj_11 obj_32)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_09 obj_30)
       (pred_3 obj_09 obj_11)
       (pred_3 obj_12 obj_03)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_12 obj_06)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_19 obj_29)
       (pred_3 obj_19 obj_23)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_25 obj_20)
       (pred_3 obj_25 obj_13)
       (pred_3 obj_25 obj_32)
       (pred_3 obj_13 obj_22)
       (pred_3 obj_13 obj_01)
       (pred_3 obj_13 obj_11)
       (pred_3 obj_13 obj_25)
       (pred_3 obj_01 obj_21)
       (pred_3 obj_01 obj_03)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_01 obj_13)
       (pred_3 obj_03 obj_31)
       (pred_3 obj_03 obj_29)
       (pred_3 obj_03 obj_12)
       (pred_3 obj_03 obj_01)
       (pred_3 obj_29 obj_15)
       (pred_3 obj_29 obj_19)
       (pred_3 obj_29 obj_03)
       (pred_3 obj_20 obj_27)
       (pred_3 obj_20 obj_22)
       (pred_3 obj_20 obj_25)
       (pred_3 obj_22 obj_04)
       (pred_3 obj_22 obj_21)
       (pred_3 obj_22 obj_13)
       (pred_3 obj_22 obj_20)
       (pred_3 obj_21 obj_02)
       (pred_3 obj_21 obj_31)
       (pred_3 obj_21 obj_01)
       (pred_3 obj_21 obj_22)
       (pred_3 obj_31 obj_26)
       (pred_3 obj_31 obj_15)
       (pred_3 obj_31 obj_03)
       (pred_3 obj_31 obj_21)
       (pred_3 obj_15 obj_17)
       (pred_3 obj_15 obj_29)
       (pred_3 obj_15 obj_31)
       (pred_3 obj_27 obj_04)
       (pred_3 obj_27 obj_20)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_04 obj_22)
       (pred_3 obj_04 obj_27)
       (pred_3 obj_02 obj_26)
       (pred_3 obj_02 obj_21)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_26 obj_17)
       (pred_3 obj_26 obj_31)
       (pred_3 obj_26 obj_02)
       (pred_3 obj_17 obj_15)
       (pred_3 obj_17 obj_26)
       (pred_11 obj_03)
       (pred_11 obj_01)
       (pred_11 obj_09)
       (pred_11 obj_17)
       (pred_10  obj_03 obj_08)
       (pred_10  obj_01 obj_14)
       (pred_10  obj_09 obj_24)
       (pred_10  obj_17 obj_08)
       (pred_5 obj_07)
       (pred_5 obj_05)
       (pred_5 obj_30)
       (pred_5 obj_06)
       (pred_5 obj_23)
       (pred_5 obj_32)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_19)
       (pred_5 obj_25)
       (pred_5 obj_13)
       (pred_5 obj_29)
       (pred_5 obj_20)
       (pred_5 obj_22)
       (pred_5 obj_21)
       (pred_5 obj_31)
       (pred_5 obj_15)
       (pred_5 obj_27)
       (pred_5 obj_04)
       (pred_5 obj_02)
       (pred_5 obj_26)

       (pred_1  obj_16 obj_08)
       (pred_1  obj_10 obj_14)
       (pred_1  obj_28 obj_24)
       (pred_1  obj_18 obj_24)
       (pred_7 obj_16 obj_31)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_28 obj_27)
       (pred_7 obj_18 obj_22)
       (pred_4 obj_06)
    )

    (:goal (and
       (pred_7 obj_18 obj_13)
    ))
(:constraints
  (always (not (pred_4 obj_11)))
)
)

; plan
1. (op_5 obj_06 obj_30)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_30)
   goals met: 0 of 1
2. (op_5 obj_30 obj_05)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_05)
   goals met: 0 of 1
3. (op_5 obj_05 obj_07)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_07)
   goals met: 0 of 1
4. (op_5 obj_07 obj_32)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_32)
   goals met: 0 of 1
5. (op_5 obj_32 obj_25)
   deleted: (pred_4 obj_32)
   added: (pred_4 obj_25)
   goals met: 0 of 1
6. (op_5 obj_25 obj_13)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_13)
   goals met: 0 of 1
7. (op_5 obj_13 obj_22)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_22)
   goals met: 0 of 1
8. (op_3 obj_22 obj_18)
   deleted: (pred_7 obj_18 obj_22) (pred_2)
   added: (pred_6 obj_18)
   goals met: 0 of 1
9. (op_5 obj_22 obj_13)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_13)
   goals met: 0 of 1
10. (op_4 obj_13 obj_18)
   deleted: (pred_6 obj_18)
   added: (pred_2) (pred_7 obj_18 obj_13)
   goals met: 1 of 1
